#include <bits/stdc++.h>

using namespace std;


// defines
#define precision(x) cout << fixed << setprecision(x);
#define fast cin.tie(0); ios::sync_with_stdio(0)
#define all(x) x.begin(), x.end()
#define rall(x) x.rbegin(), x.rend()
#define ff first
#define ss second
// #define nl endl
#define nl "\n"
#define sp " "
#define yes "Yes"
#define no "No"
#define int long long
///////////////////////////////////////////


// constants
const int inf = 1e18;

// const int mod = 1e9 + 7;
// const int pmod = 1e9 + 6;

// const int mod = 998244353;
// const int pmod = 998244352;
// const int root = 3;
///////////////////////////////////////////

// iofstreams
ifstream in("input.txt");
ofstream out("output.txt");
///////////////////////////////////////////

// random generator
random_device rdev;
mt19937 reng(rdev());
uniform_int_distribution<mt19937::result_type> dist(1, 1e9 + 7);
///////////////////////////////////////////

// globals

///////////////////////////////////////////

// solution
void solve() {
    
}


// preprocessing
void prepr() { }


// etrance
signed main() {
    precision(15);
    fast;
    prepr();
    int t = 1;
    //cin >> t;
    while (t--) solve();
}

// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣴⠞⠛⠛⠻⡿⣿⡷⣶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡞⣿⣦⣄⢖⣒⣿⢿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⢫⣿⣟⣻⣿⡋⢻⡝⣿⡏⡧⡫⣗⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠋⠠⣫⡭⢽⣿⡾⣧⣽⣿⡼⣟⢾⡌⢿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣶⠐⣿⣿⠟⠋⢻⣿⡸⣿⣏⣍⢻⡭⠾⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⠳⣀⢀⣀⣤⣗⣿⣿⣟⣿⠌⢈⡹⡸⣜⠿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠬⣸⣿⣿⣿⣷⣾⡟⠉⠉⢹⣿⡟⣿⡿⡃⠚⠻⣻⢹⡷⡈⢷⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⢰⡇⢻⣿⣿⣿⣿⡏⠀⠀⠀⠀⠣⣏⣗⢧⣸⠧⣿⣼⣷⡈⠀⢿⢧⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⣈⠷⢾⣿⣿⣿⣏⠁⠀⠀⠀⠀⢸⣿⣿⣸⣛⡨⡸⣼⣹⣯⠑⠚⡆⠉⠳⢦⣀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⢎⣤⡄⣸⣿⣿⣿⣷⣿⣵⣔⣶⣧⣼⣿⣻⠿⡤⣝⣽⣿⣿⡏⠀⢀⡇⠀⠀⠀⠈⠙⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠈⢺⣺⣿⣿⣿⣿⣿⣿⣾⣿⣙⣿⣟⣷⣜⣿⡟⣽⣇⣿⡖⢁⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡀⢀⣀⣫⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⡿⣿⡟⣷⣻⣿⣿⣿⣇⠚⠄⢸⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢇⣼⣿⡏⣹⣿⣿⣿⣿⣿⡾⣿⣿⡿⣿⣿⣇⣿⢏⢿⣿⣧⣿⡀⡀⢸⢿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⢻⡃⣾⣿⣿⣿⣯⣿⣷⣯⣿⣿⣿⣿⣿⣿⢾⣾⣿⣿⡛⣷⡈⢸⣾⣿⠆⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣾⣿⠚⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⢹⣳⢯⡮⠤⢸⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡛⣾⣹⣿⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣕⢼⡎⣷⣷⠶⠚⠉⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡾⡻⣯⡼⡎⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣤⡟⣿⣿⢓⡀⢒⢫⠣⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠉⠉⠀⢳⠈⢻⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⠋⠁⠀⢻⣆⣧⢸⣸⠀⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⢠⡀⠈⣇⢸⢻⡍⠹⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⣠⣸⢿⡧⣽⣦⣀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡾⢤⣢⢧⠀⢹⠸⠀⠹⡄⠀⠀⠀⠀⠀⠀⢀⣤⣤⡾⣿⡵⣬⣆⠈⢧⠊⣦⡀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⢰⣟⢿⣧⡞⠀⠀⠀⠘⢦⣶⣷⣶⣶⣿⣿⣿⣿⣿⣿⣿⡷⣾⡢⠸⡄⠹⣕⣄⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⠈⢷⢳⢹⡇⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⢿⣿⣻⡟⡆⢣⢸⡻⠽⣿⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣷⠋⡗⢪⡇⠀⠀⠀⠀⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡹⢸⣐⣒⣸⣨⣇⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⠁⢙⣄⡇⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠂⠧⠤⠤⢝⣽⡆⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣀⡀⢙⡇⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣿⣿⣽⡧⡀⠰⡀⠀⠀⠘⢷⠀
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⡭⢝⡇⠀⠀⠀⢾⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣾⣇⢰⢷⣄⣉⣒⣀⠀⠘⡄
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⢃⠈⣇⣾⣵⣰⣯⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⡟⣠⢞⣽⠑⢖⢪⢧⡀⢣
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣈⠧⣹⣿⣿⣟⡭⠟⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⠁⣭⠥⢥⣕⣕⢷⣝⣇⢸
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠗⠲⣄⠙⣿⠀⠀⢼⠉⠀⠀⠙⠻⣿⣿⣿⣿⣿⣿⣿⣿⢰⠁⢨⡉⠙⠛⢧⡹⣿⣸
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢤⠀⠈⠻⣜⢄⠀⣨⠇⠀⠀⠀⠀⠈⣻⣿⣿⣿⣿⠋⢸⣼⠀⢀⣿⠆⠀⠀⠹⠟⡇
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠋⣴⣿⡿⣦⣗⡔⠁⠀⠀⠀⠀⢀⣼⣿⠟⠿⠿⠇⠀⠈⢻⡄⢸⠀⢳⣄⠀⠀⠀⡇
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⢧⣿⣿⣿⣾⠟⠛⠀⠀⠀⠀⣐⢿⡿⠁⠀⠀⠀⠀⠀⠀⠈⣷⠀⠀⠀⠹⣆⣀⣤⣸
// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠟⡏⠈⠻⠿⣻⠇⠀⠀⠀⢀⣀⣉⣴⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣄⣠⣴⣿⣿⣿⣿⡿

// Мы повзрослели и мы теперь по себе сами
// Превратились в затылки перед чужими глазами
// Где - то там далеко, за стеклом изо льда
// Дрогнули провода, пронеслись поезда
// И больше нет никого дома
// Сорняки на асфальте, недостроенные новостройки
// За заросшей железной дорогой гаражи и помойки
// Там теперь новый мост в новые времена
// Под ним мы оставим свои имена
// Рядом с матерным словом
// Нас с детства научила выживать и не сдаваться
// Огромная и протиеворечивая страна
// Так сложно найти место в ней, так просто потеряться
// Зима по горло, в сердце весна
// Связанные этой прочной невидимой ниткой
// Всем холодным ветрам и всему во вселенной открытки
// Из забытых стихов, из разбитых витрин
// Из сжатых пружин и натянутых жил
// Сломаны, сломаны, сломаны,
// Но непобедимы
// Нас с детства научила выживать и не сдаваться
// Огромная и противоречивая страна
// Так сложно найти место в ней, так просто потеряться
// Зима по горло, в сердце весна
// Нас с детства научила выживать и не сдаваться
// Огромная и противоречивая страна
// Так сложно найти место в ней, так просто потеряться
// Зима по горло, в сердце весна
// Нас с детства научила выживать и не сдаваться
// Огромная и противоречивая страна
// Так сложно найти место в ней, так просто потеряться